In [1]:
import pandas as pd
import numpy as np

### Series data structure in pandas

In [2]:
list1 = [10,20,30,40,50,60]
print(list1)

[10, 20, 30, 40, 50, 60]

In [3]:
s1 = pd.Series(list1)
print(s1)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [4]:
s2 = pd.Series(list1, index = ["A", "B", "C","D", "E","F"])
print(s2)

A    10
B    20
C    30
D    40
E    50
F    60
dtype: int64

In [5]:
arr1 = np.array([23,45,67,86,34])
arr2 = np.array([12,15,57,87,44])
arr1, arr2

(array([23, 45, 67, 86, 34]), array([12, 15, 57, 87, 44]))

In [6]:
sr11 = pd.Series(arr1)
sr22 = pd.Series(arr2)

In [7]:
sr11

0    23
1    45
2    67
3    86
4    34
dtype: int64

In [8]:
sr22

0    12
1    15
2    57
3    87
4    44
dtype: int64

In [9]:
sr11 + sr22

0     35
1     60
2    124
3    173
4     78
dtype: int64

### Data frame for 2D dataset

In [10]:
student_list = ["kromn", "samir", "lalu","manash","bibek"]
roll_no = ["001","002","003","004","005"]
marks = [60,61.23,60,59,56.56]

In [11]:
student_dict = {
    "Student Name": student_list,
    "Roll No": roll_no,
    "Marks Obtained": marks 
}

In [12]:
student_dict

{'Student Name': ['kromn', 'samir', 'lalu', 'manash', 'bibek'],
 'Roll No': ['001', '002', '003', '004', '005'],
 'Marks Obtained': [60, 61.23, 60, 59, 56.56]}

In [13]:
student_df = pd.DataFrame(student_dict)
student_df

  Student Name Roll No  Marks Obtained
0        kromn     001           60.00
1        samir     002           61.23
2         lalu     003           60.00
3       manash     004           59.00
4        bibek     005           56.56

In [14]:
student_df.set_index("Roll No", )

        Student Name  Marks Obtained
Roll No
001            kromn           60.00
002            samir           61.23
003             lalu           60.00
004           manash           59.00
005            bibek           56.56

In [15]:
student_df[["Student Name", "Marks Obtained"]]

  Student Name  Marks Obtained
0        kromn           60.00
1        samir           61.23
2         lalu           60.00
3       manash           59.00
4        bibek           56.56

### Adding new column in the existing dataframe

In [16]:
student_df

  Student Name Roll No  Marks Obtained
0        kromn     001           60.00
1        samir     002           61.23
2         lalu     003           60.00
3       manash     004           59.00
4        bibek     005           56.56

In [17]:
student_df["Address"] = ["Inaruwa","Ithari","Biratnagar","Ithari","Biratnagar"]

In [18]:
student_df

  Student Name Roll No  Marks Obtained     Address
0        kromn     001           60.00     Inaruwa
1        samir     002           61.23      Ithari
2         lalu     003           60.00  Biratnagar
3       manash     004           59.00      Ithari
4        bibek     005           56.56  Biratnagar

In [19]:
df2 = pd.DataFrame({
    "A": np.arange(1,11),
    "B": np.arange(11,21)
})

In [20]:
df2

    A   B
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [21]:
df2["C"] = df2["A"]+ df2["B"]
df2["C"]

0    12
1    14
2    16
3    18
4    20
5    22
6    24
7    26
8    28
9    30
Name: C, dtype: int64

In [22]:
df2["D"] = (df2["A"]+ df2["B"] + df2["C"])/3
df2["D"]

0     8.000000
1     9.333333
2    10.666667
3    12.000000
4    13.333333
5    14.666667
6    16.000000
7    17.333333
8    18.666667
9    20.000000
Name: D, dtype: float64

In [23]:
df2

    A   B   C          D
0   1  11  12   8.000000
1   2  12  14   9.333333
2   3  13  16  10.666667
3   4  14  18  12.000000
4   5  15  20  13.333333
5   6  16  22  14.666667
6   7  17  24  16.000000
7   8  18  26  17.333333
8   9  19  28  18.666667
9  10  20  30  20.000000

In [68]:
student_dict = {
    "student": ["student1","student2","student1","samir","student5","student6","student7","student8"],
    "Roll No": [1,np.nan, 1,3,4,5,6,7],
    "Gender": ["Male","Female","Male",np.nan,"Male","Female","Female","Male"],
    "Marks_obtained":[56,76,56,43,67, np.nan ,73,75]
}

In [69]:
student_df = pd.DataFrame(student_dict)
student_df

    student  Roll No  Gender  Marks_obtained
0  student1      1.0    Male            56.0
1  student2      NaN  Female            76.0
2  student1      1.0    Male            56.0
3     samir      3.0     NaN            43.0
4  student5      4.0    Male            67.0
5  student6      5.0  Female             NaN
6  student7      6.0  Female            73.0
7  student8      7.0    Male            75.0

### To check the duplicate value

In [70]:
student_df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [71]:
# (.sum()) gives the value of duplication
student_df.duplicated().sum()

np.int64(1)

In [72]:
# Now deleting the duplicate value 
student_df = student_df.drop_duplicates()
student_df

    student  Roll No  Gender  Marks_obtained
0  student1      1.0    Male            56.0
1  student2      NaN  Female            76.0
3     samir      3.0     NaN            43.0
4  student5      4.0    Male            67.0
5  student6      5.0  Female             NaN
6  student7      6.0  Female            73.0
7  student8      7.0    Male            75.0

In [73]:
#deleting the null value records by using (.dropna)
student_df2 = student_df.dropna()
student_df2

    student  Roll No  Gender  Marks_obtained
0  student1      1.0    Male            56.0
4  student5      4.0    Male            67.0
6  student7      6.0  Female            73.0
7  student8      7.0    Male            75.0

### Tmputation method:(mean,median and mode)

In [74]:
gender_mode = student_df["Gender"].mode()
gender_mode

0    Female
1      Male
Name: Gender, dtype: object

In [75]:
#[0] give the 0 index value from above 
gender_mode = student_df["Gender"].mode()[0]
gender_mode

'Female'

In [76]:
student_df["Gender"] = student_df["Gender"].fillna(gender_mode)
student_df

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15704\509026603.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_df["Gender"] = student_df["Gender"].fillna(gender_mode)

    student  Roll No  Gender  Marks_obtained
0  student1      1.0    Male            56.0
1  student2      NaN  Female            76.0
3     samir      3.0  Female            43.0
4  student5      4.0    Male            67.0
5  student6      5.0  Female             NaN
6  student7      6.0  Female            73.0
7  student8      7.0    Male            75.0

In [77]:
marks_mean = student_df["Marks_obtained"].mean()

In [78]:
marks_mean = np.round(marks_mean, 2)
marks_mean

np.float64(65.0)

In [79]:
student_df["Marks_obtained"] = student_df["Marks_obtained"].fillna(marks_mean)
student_df

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15704\3246371565.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_df["Marks_obtained"] = student_df["Marks_obtained"].fillna(marks_mean)

    student  Roll No  Gender  Marks_obtained
0  student1      1.0    Male            56.0
1  student2      NaN  Female            76.0
3     samir      3.0  Female            43.0
4  student5      4.0    Male            67.0
5  student6      5.0  Female            65.0
6  student7      6.0  Female            73.0
7  student8      7.0    Male            75.0

In [81]:
student_df = student_df.dropna()
student_df

    student  Roll No  Gender  Marks_obtained
0  student1      1.0    Male            56.0
3     samir      3.0  Female            43.0
4  student5      4.0    Male            67.0
5  student6      5.0  Female            65.0
6  student7      6.0  Female            73.0
7  student8      7.0    Male            75.0

In [83]:
student_df[["Roll No","Marks_obtained"]]

   Roll No  Marks_obtained
0      1.0            56.0
3      3.0            43.0
4      4.0            67.0
5      5.0            65.0
6      6.0            73.0
7      7.0            75.0

In [85]:
# To watch the list of column
student_df.columns

Index(['student', 'Roll No', 'Gender', 'Marks_obtained'], dtype='object')

### Loading the dataset

In [87]:
df = pd.read_csv(r"C:\Users\LENOVO\Desktop\theory.py\Titanic-Dataset.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q